{"guides": [
        {"tag": "Searching for stocks",
         "response": ["You can search for stocks using the search bar on the top right. You can use the search bar at the top right of the page. Type in parts of a stock name or stock codeand our autocomplete feature will try to guess the stock you are trying to find. Click on the stock if the autocomplete feature has the stock you are looking for. Once entered, you can click Search right next to the search bar on the right and it will take you to the stock page."]
        },
        {"tag": "Buying stocks",
         "response": ["Note that all stocks purchased are simulated and are not real. This is for practice purposes only. Buying a stock here means you simul-own it. Buying a stock is simple. First, you will need to find the stock you are looking for. You can use the search bar for this, or click on a stock from your watchlist. Doing so will take you to the stock's page where you can view information on the stock. Click on the Buy stock button. This button will take you to a page whereyou can choose how many of the stock you want to buy. Once you have decided on the quantity, click Proceed to go to the checkout page. This page will tell you the market price for the stock and the quantity you have chosen to buy. You can cancel to go back the stock page and try again (or do something else) or, if you are happy with the information, you can click Checkout to finalise your purchase. You are now done. You have successfully purchased your stocks."]
        },
        {"tag": "Selling your stocks",
         "response": ["Note that all stocks you sell here are simulated and are not real. This is for practice purposes only. Selling a stock here means you sold a stock you simul-own.Selling stocks takes some steps for buying stocks. You will need to find the stock you are looking for. You can use the search bar, or click on the stock from your watchlist. This will take you to the stock's page. If you simul-own the stock, then you will see a button next to the Buy stock button named Sell stock. Click on Sell stock to be directed to a page where you can choose how many stocks to sell. Entering more than what you actually simul-own will not allow you to proceed and you will need to enter a valid number. After entering a valid quantity, click on Proceed to go to the checkout page. The stock price and the quantity you entered will be shown. If you are happy with what you see, click Checkout to finalise your sell order, otherwise, click cancel to go back to the stock's page."]
        },
        {"tag": "Using your watchlist",
         "response": ["Your watchlist is usually visible on the right side on most pages on LeetTrader. You may click on stocks here to be taken to the respective stock's page. This make it easy and quick to make buy or sell orders, view detailed information, removing stock from your watchlist or adding it as a reminder. See the relevant tutorials for more information on how to do said actions. Your watchlist also displays some information on the stock: the stock name, stock code, market price, price change and percentage change. This lets you react to market changes quickly while you are on LeetTrader."]
        },
        {"tag": "Adding to your watchlist",
         "response": ["You will need to go to the stock's page. You will have to use the search bar for this. Once you have searched for your interested stock and have been directed to the stock's page. Click the Add to watchlist button below the stock's information. This will add the stock to your watchlist and will be immediately visible on the watchlist on the right. If there is no Add to watchlist button and Remove from watchlist is appears instead, this means that the stock is already in your watchlist."]
        },
        {"tag": "Removing from your watchlist",
         "response": ["The quickest way is to click on the stock you want to remove on your watchlist. This will take you to the stock's page. Click on Remove from watchlist. A pop-up will appear asking for confirmation to remove the stock from your watchlist. Click Remove to confirm the removal of the stock from your watchlist. Otherwise, click cancel if you don't want to remove that stock. If you have clicked Remove, the stock will be immediately removed from your watchlist."]
        },
        {"tag": "Viewing reminders",
         "response": ["Reminders help keep you updated and notified when the price of a stock reaches or goes beyond the set price. For example, if the current price of a stock is $0.10 and you set a reminder for $0.30, then, if the stock price reaches or goes above $0.30, you will be notified via email. On the other hand, If the current stock price is $0.60 and you set a reminder for $0.40, then you will receive an email notification if the stock price reaches $0.40 or below. You can view your current reminders by using the drop down menu on the right of the top bar. Expand the drop down menu and click on View reminders. This will take you to a page that will display all the reminders you have currently set."]
        },
        {"tag": "Adding reminders",
         "response": ["Go to the stock's page by using your watchlist if you have added the stock to your watchlist. Otherwise, use the search bar to look for the stock and click Search. Doing any of these will lead you to the stock's page. Under the stock's information, there will be some buttons. Click on the Add reminder button. You will be take to a page where you can set at which price you would like to be notified. Once you have decided on the price, click Add to confirm. You will now be notified when the stock reaches that amount or beyond. You may also click cancel if you change your mind. Reminders can be set to single time notifications."]
        },
        {"tag": "Deleting reminders",
         "response": ["View your reminders by going to the view reminders page (see Viewing reminders tutorial if you are unsure). There will be a Remove button on the right of each reminder. Look for the reminder you wish to remove and click the Remove button to the right of it. Once done, you will no longer be notified."]
        },
        {"tag": "Viewing historical data",
         "response": ["The historical data contains previous stock prices. To view this, go to the stock's page. You can do this using the watchlist if you have added the stock to your watchlist. Otherwise, use the search bar to find the stock. Doing either of this will lead you to the stock's page where the historical data will be displayed."]
        },
        {"tag": "Viewing profit or loss for a specific simul-owned stock",
         "response": [""]
        },
        {"tag": "Viewing profit or loss for all simul-owned stock",
         "response": [""]
        },
        {"tag": "Resetting password",
         "response": ["On the login page, there is a forgot password button. Click on this to be directed to a page where you can enter your email. After entering your email, click Send confirmation. you cannot send another confirmation email for some time. Look at your emails (don't forget to check your spam) for the confirmation email. It will contain a link. Open the email and click on the link to be directed to the reset password page. This link will expire after 30 minutes. Note that you cannot use the old password as the new password. You will need to enter your password twice to ensure you have entered your new password correctly."]
        },
        {"tag": "Deleting your account",
         "response": ["Expand the drop down menu on the right side of the top bar. Click on Manage account. You will be directed to a page where you can click on the Delete account button. You will be sent an email containing two links: one for confirming the deletion of your account and one to change your password. If it is you who have requested the deletion of your account, click on the link that will delete your account. Otherwise, your account may be compromised and it is recommended you change your password using the given link."]
        }
    ]
}